//Напишите программу, которая выводит третью цифру заданного 
//числа или сообщает, что третьей цифры нет.
Console.WriteLine("Введите число n:");
int abc = Convert.ToInt32(Console.ReadLine());
